ERP.belugaerp/src/InformationRegisters/бг_КредитныеЛимиты/бг_КредитныеЛимиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_КредитныеЛимиты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидЛимита</name>
    <type>
      <types>EnumRef.бг_ВидыКредитныхЛимитов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктНазначения</name>
    <type>
      <types>CatalogRef.битПунктыНазначения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_КредитныеЛимиты/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	Для Каждого МенеджерЗаписи Из ЭтотОбъект Цикл
		ПроверитьВозможностьЗаписи(Отказ, МенеджерЗаписи);	
    КонецЦикла;
КонецПроцедуры

Процедура ПроверитьВозможностьЗаписи(Отказ, МенеджерЗаписи)
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	бг_КредитныеЛимиты.ВидЛимита КАК ВидЛимита,
		|	бг_КредитныеЛимиты.Контрагент КАК Контрагент,
		|	бг_КредитныеЛимиты.Договор КАК Договор,
		|	бг_КредитныеЛимиты.ПунктНазначения КАК ПунктНазначения,
		|	бг_КредитныеЛимиты.Контрагент.Представление КАК КонтрагентПредставление,
		|	бг_КредитныеЛимиты.ПунктНазначения.Представление КАК ПунктНазначенияПредставление,
		|	бг_КредитныеЛимиты.Договор.Представление КАК ДоговорПредставление
		|ИЗ
		|	РегистрСведений.бг_КредитныеЛимиты КАК бг_КредитныеЛимиты
		|ГДЕ
		|	бг_КредитныеЛимиты.ВидЛимита = &ВидЛимита
		|	И бг_КредитныеЛимиты.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("ВидЛимита", МенеджерЗаписи.ВидЛимита);
	Запрос.УстановитьПараметр("Контрагент", МенеджерЗаписи.Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ЗаполненДоговорМенеджерЗаписи = ЗначениеЗаполнено(МенеджерЗаписи.Договор);	
	ЗаполненПунктНазначенияМенеджерЗаписи = ЗначениеЗаполнено(МенеджерЗаписи.ПунктНазначения);	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл					
		ЗаполненДоговорВыборка = ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Договор);	
		ЗаполненПунктНазначенияВыборка = ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПунктНазначения);
		Если Не ЗаполненДоговорМенеджерЗаписи = ЗаполненДоговорВыборка Тогда
			Отказ = Истина; 	  
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось выполнить запись. 
									|Недопускается установка лимита в разрезе Договора,
									|если для указанного контрагента и лимита уже имеются записи без Договора 
									|и наоборот если ранее лимиты были установлены в разрезе Договора, то
									|нельзя устанавливать лимит не в разрезе Договора.
									|Вы пытаетесь записать следующие значения:
									|Вид лимита: %1, значение в регистре %2;
									|Контрагент: %3, значение в регистре %4;
									|Договор: %5, значение в регистре %6'"),
									МенеджерЗаписи.ВидЛимита,
									ВыборкаДетальныеЗаписи.ВидЛимита,
									МенеджерЗаписи.Контрагент,
									ВыборкаДетальныеЗаписи.КонтрагентПредставление,
									?(ЗначениеЗаполнено(МенеджерЗаписи.Договор), 
															МенеджерЗаписи.Договор, 
															"Значение незаполнено"),
									?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДоговорПредставление),
															МенеджерЗаписи.Договор, 
															"Значение незаполнено"));			
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			Прервать;	
		ИначеЕсли Не ЗаполненПунктНазначенияМенеджерЗаписи = ЗаполненПунктНазначенияВыборка Тогда
			Отказ = Истина; 	  
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось выполнить запись. 
									|Недопускается установка лимита в разрезе Пункта назначения,
									|если для указанного контрагента и лимита уже имеются записи без Пункта назначения 
									|и наоборот если ранее лимиты были установлены в разрезе Пункта назначения, то
									|нельзя устанавливать лимит не в разрезе Пункта назначения.
									|Вы пытаетесь записать следующие значения:
									|Вид лимита: %1, значение в регистре %2;
									|Контрагент: %3, значение в регистре %4;
									|Пункт назначения: %5, значение в регистре %6'"),
									МенеджерЗаписи.ВидЛимита,
									ВыборкаДетальныеЗаписи.ВидЛимита,
									МенеджерЗаписи.Контрагент,
									ВыборкаДетальныеЗаписи.КонтрагентПредставление,
									?(ЗначениеЗаполнено(МенеджерЗаписи.ПунктНазначения), 
															МенеджерЗаписи.ПунктНазначения, 
															"Значение незаполнено"),
									?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПунктНазначенияПредставление), 
															ВыборкаДетальныеЗаписи.ПунктНазначенияПредставление, 
															"Значение незаполнено"));			
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			Прервать;		
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
